<?php
/**
 * Created by PhpStorm.
 * User=> Administrator
 * Date=> 2018/12/24 0024
 * Time=> 23=>52
 */

$cnColorArr = [
    [
        'name' => "乳白",
        'rgb' => "249, 244, 220",
        'value' => "#f9f4dc"
    ],
    [
        'name' => "杏仁黄",
        'rgb' => "249, 236, 195",
        'value' => "#f7e8aa"
    ],
    [
        'name' => "茉莉黄",
        'rgb' => "248, 223, 114",
        'value' => "#f8df72"
    ],
    [
        'name' => "麦秆黄",
        'rgb' => "248, 223, 112",
        'value' => "#f8df70"
    ],
    [
        'name' => "油菜花黄",
        'rgb' => "251, 218, 65",
        'value' => "#fbda41"
    ],
    [
        'name' => "佛手黄",
        'rgb' => "254, 215, 26",
        'value' => "#fed71a"
    ],
    [
        'name' => "篾黄",
        'rgb' => "247, 222, 152",
        'value' => "#f7de98"
    ],
    [
        'name' => "葵扇黄",
        'rgb' => "248, 216, 106",
        'value' => "#f8d86a"
    ],
    [
        'name' => "柠檬黄",
        'rgb' => "252, 211, 55",
        'value' => "#fcd337"
    ],
    [
        'name' => "金瓜黄",
        'rgb' => "252, 210, 23",
        'value' => "#fcd217"
    ],
    [
        'name' => "藤黄",
        'rgb' => "254, 209, 16",
        'value' => "#ffd111"
    ],
    [
        'name' => "酪黄",
        'rgb' => "246, 222, 173",
        'value' => "#f6dead"
    ],
    [
        'name' => "香水玫瑰黄",
        'rgb' => "247, 218, 148",
        'value' => "#f7da94"
    ],
    [
        'name' => "淡密黄",
        'rgb' => "249, 211, 103",
        'value' => "#f9d367"
    ],
    [
        'name' => "大豆黄",
        'rgb' => "251, 205, 49",
        'value' => "#fbcd31"
    ],
    [
        'name' => "素馨黄",
        'rgb' => "252, 203, 22",
        'value' => "#fccb16"
    ],
    [
        'name' => "向日葵黄",
        'rgb' => "254, 204, 17",
        'value' => "#fecc11"
    ],
    [
        'name' => "雅梨黄",
        'rgb' => "251, 200, 47",
        'value' => "#fbc82f"
    ],
    [
        'name' => "黄连黄",
        'rgb' => "252, 197, 21",
        'value' => "#fcc515"
    ],
    [
        'name' => "金盏黄",
        'rgb' => "252, 195, 7",
        'value' => "#fcc307"
    ],
    [
        'name' => "蛋壳黄",
        'rgb' => "248, 195, 135",
        'value' => "#f8c387"
    ],
    [
        'name' => "肉色",
        'rgb' => "247, 193, 115",
        'value' => "#f7c173"
    ],
    [
        'name' => "鹅掌黄",
        'rgb' => "251, 185, 41",
        'value' => "#fbb929"
    ],
    [
        'name' => "鸡蛋黄",
        'rgb' => "251, 182, 18",
        'value' => "#fbb612"
    ],
    [
        'name' => "鼬黄",
        'rgb' => "252, 183, 10",
        'value' => "#fcb70a"
    ],
    [
        'name' => "榴萼黄",
        'rgb' => "249, 166, 51",
        'value' => "#f9a633"
    ],
    [
        'name' => "淡橘橙",
        'rgb' => "251, 164, 20",
        'value' => "#fba414"
    ],
    [
        'name' => "枇杷黄",
        'rgb' => "252, 161, 6",
        'value' => "#fca106"
    ],
    [
        'name' => "橙皮黄",
        'rgb' => "252, 161, 4",
        'value' => "#fca104"
    ],
    [
        'name' => "北瓜黄",
        'rgb' => "252, 140, 35",
        'value' => "#fc8c23"
    ],
    [
        'name' => "杏黄",
        'rgb' => "250, 142, 22",
        'value' => "#f28e16"
    ],
    [
        'name' => "雄黄",
        'rgb' => "255, 153, 0",
        'value' => "#ff9900"
    ],
    [
        'name' => "万寿菊黄",
        'rgb' => "251, 139, 5",
        'value' => "#fb8b05"
    ],
    [
        'name' => "菊蕾白",
        'rgb' => "233, 221, 182",
        'value' => "#e9ddb6"
    ],
    [
        'name' => "秋葵黄",
        'rgb' => "238, 208, 69",
        'value' => "#eed045"
    ],
    [
        'name' => "硫华黄",
        'rgb' => "242, 206, 43",
        'value' => "#f2ce2b"
    ],
    [
        'name' => "柚黄",
        'rgb' => "241, 202, 23",
        'value' => "#f1ca17"
    ],
    [
        'name' => "芒果黄",
        'rgb' => "221, 200, 113",
        'value' => "#ddc871"
    ],
    [
        'name' => "蒿黄",
        'rgb' => "223, 194, 67",
        'value' => "#dfc243"
    ],
    [
        'name' => "姜黄",
        'rgb' => "226, 192, 39",
        'value' => "#e2c027"
    ],
    [
        'name' => "香蕉黄",
        'rgb' => "228, 191, 17",
        'value' => "#e4bf11"
    ],
    [
        'name' => "草黄",
        'rgb' => "210, 180, 44",
        'value' => "#d2b42c"
    ],
    [
        'name' => "新禾绿",
        'rgb' => "210, 177, 22",
        'value' => "#d2b116"
    ],
    [
        'name' => "月灰",
        'rgb' => "183, 174, 143",
        'value' => "#b7ae8f"
    ],
    [
        'name' => "淡灰绿",
        'rgb' => "173, 158, 85",
        'value' => "#ad9e5f"
    ],
    [
        'name' => "草灰绿",
        'rgb' => "142, 128, 75",
        'value' => "#8e804b"
    ],
    [
        'name' => "苔绿",
        'rgb' => "136, 115, 34",
        'value' => "#887322"
    ],
    [
        'name' => "碧螺春绿",
        'rgb' => "134, 112, 24",
        'value' => "#867018"
    ],
    [
        'name' => "燕羽灰",
        'rgb' => "104, 94, 72",
        'value' => "#685e48"
    ],
    [
        'name' => "蟹壳灰",
        'rgb' => "105, 94, 69",
        'value' => "#695e45"
    ],
    [
        'name' => "潭水绿",
        'rgb' => "100, 88, 34",
        'value' => "#645822"
    ],
    [
        'name' => "橄榄绿",
        'rgb' => "94, 83, 20",
        'value' => "#5e5314"
    ],
    [
        'name' => "蚌肉白",
        'rgb' => "249, 241, 219",
        'value' => "#f9f1db"
    ],
    [
        'name' => "豆汁黄",
        'rgb' => "248, 232, 193",
        'value' => "#f8e8c1"
    ],
    [
        'name' => "淡茧黄",
        'rgb' => "249, 215, 112",
        'value' => "#f9d770"
    ],
    [
        'name' => "乳鸭黄",
        'rgb' => "255, 201, 12",
        'value' => "#ffc90c"
    ],
    [
        'name' => "荔肉白",
        'rgb' => "242, 230, 206",
        'value' => "#f2e6ce"
    ],
    [
        'name' => "象牙黄",
        'rgb' => "240, 214, 149",
        'value' => "#f0d695"
    ],
    [
        'name' => "炒米黄",
        'rgb' => "244, 206, 105",
        'value' => "#f4ce69"
    ],
    [
        'name' => "鹦鹉冠黄",
        'rgb' => "246, 196, 48",
        'value' => "#f6c430"
    ],
    [
        'name' => "木瓜黄",
        'rgb' => "249, 193, 22",
        'value' => "#f9c116"
    ],
    [
        'name' => "浅烙黄",
        'rgb' => "249, 189, 16",
        'value' => "#f9bd10"
    ],
    [
        'name' => "莲子白",
        'rgb' => "229, 211, 170",
        'value' => "#e5d3aa"
    ],
    [
        'name' => "谷黄",
        'rgb' => "232, 176, 4",
        'value' => "#e8b004"
    ],
    [
        'name' => "栀子黄",
        'rgb' => "235, 177, 13",
        'value' => "#ebb10d"
    ],
    [
        'name' => "芥黄",
        'rgb' => "217, 164, 14",
        'value' => "#d9a40e"
    ],
    [
        'name' => "银鼠灰",
        'rgb' => "181, 170, 144",
        'value' => "#b5aa90"
    ],
    [
        'name' => "尘灰",
        'rgb' => "182, 164, 118",
        'value' => "#b6a476"
    ],
    [
        'name' => "枯绿",
        'rgb' => "183, 141, 18",
        'value' => "#b78d12"
    ],
    [
        'name' => "鲛青",
        'rgb' => "135, 114, 62",
        'value' => "#87723e"
    ],
    [
        'name' => "粽叶绿",
        'rgb' => "135, 104, 24",
        'value' => "#876818"
    ],
    [
        'name' => "灰绿",
        'rgb' => "138, 105, 19",
        'value' => "#8a6913"
    ],
    [
        'name' => "鹤灰",
        'rgb' => "74, 64, 53",
        'value' => "#4a4035"
    ],
    [
        'name' => "淡松烟",
        'rgb' => "77, 64, 48",
        'value' => "#4d4030"
    ],
    [
        'name' => "暗海水绿",
        'rgb' => "88, 71, 23",
        'value' => "#584717"
    ],
    [
        'name' => "棕榈绿",
        'rgb' => "91, 73, 19",
        'value' => "#5b4913"
    ],
    [
        'name' => "米色",
        'rgb' => "249, 223, 205",
        'value' => "#f9e9cd"
    ],
    [
        'name' => "淡肉色",
        'rgb' => "248, 224, 176",
        'value' => "#f8e0b0"
    ],
    [
        'name' => "麦芽糖黄",
        'rgb' => "249, 210, 125",
        'value' => "#f9d27d"
    ],
    [
        'name' => "琥珀黄",
        'rgb' => "254, 186, 7",
        'value' => "#feba07"
    ],
    [
        'name' => "甘草黄",
        'rgb' => "243, 191, 76",
        'value' => "#f3bf4c"
    ],
    [
        'name' => "初熟杏黄",
        'rgb' => "248, 188, 49",
        'value' => "#f8bc31"
    ],
    [
        'name' => "浅驼色",
        'rgb' => "226, 193, 124",
        'value' => "#e2c17c"
    ],
    [
        'name' => "沙石黄",
        'rgb' => "229, 183, 81",
        'value' => "#e5b751"
    ],
    [
        'name' => "虎皮黄",
        'rgb' => "234, 173, 26",
        'value' => "#eaad1a"
    ],
    [
        'name' => "土黄",
        'rgb' => "214, 160, 29",
        'value' => "#d6a01d"
    ],
    [
        'name' => "百灵鸟灰",
        'rgb' => "180, 169, 146",
        'value' => "#b4a992"
    ],
    [
        'name' => "山鸡黄",
        'rgb' => "183, 139, 38",
        'value' => "#b78b26"
    ],
    [
        'name' => "龟背黄",
        'rgb' => "130, 107, 72",
        'value' => "#826b48"
    ],
    [
        'name' => "苍黄",
        'rgb' => "128, 99, 50",
        'value' => "#806332"
    ],
    [
        'name' => "莱阳梨黄",
        'rgb' => "129, 95, 37",
        'value' => "#815f25"
    ],
    [
        'name' => "蜴蜊绿",
        'rgb' => "131, 94, 29",
        'value' => "#835e1d"
    ],
    [
        'name' => "松鼠灰",
        'rgb' => "79, 64, 50",
        'value' => "#4f4032"
    ],
    [
        'name' => "橄榄灰",
        'rgb' => "80, 62, 42",
        'value' => "#503e2a"
    ],
    [
        'name' => "蟹壳绿",
        'rgb' => "81, 60, 32",
        'value' => "#513c20"
    ],
    [
        'name' => "古铜绿",
        'rgb' => "83, 60, 27",
        'value' => "#533c1b"
    ],
    [
        'name' => "焦茶绿",
        'rgb' => "85, 59, 24",
        'value' => "#553b18"
    ],
    [
        'name' => "粉白",
        'rgb' => "251, 242, 227",
        'value' => "#fbf2e3"
    ],
    [
        'name' => "落英淡粉",
        'rgb' => "249, 232, 208",
        'value' => "#f9e8d0"
    ],
    [
        'name' => "瓜瓤粉",
        'rgb' => "249, 203, 139",
        'value' => "#f9cb8b"
    ],
    [
        'name' => "蜜黄",
        'rgb' => "251, 185, 87",
        'value' => "#fbb957"
    ],
    [
        'name' => "金叶黄",
        'rgb' => "255, 166, 15",
        'value' => "#ffa60f"
    ],
    [
        'name' => "金莺黄",
        'rgb' => "244, 168, 58",
        'value' => "#f4a83a"
    ],
    [
        'name' => "鹿角棕",
        'rgb' => "227, 189, 141",
        'value' => "#e3bd8d"
    ],
    [
        'name' => "凋叶棕",
        'rgb' => "231, 162, 63",
        'value' => "#e7a23f"
    ],
    [
        'name' => "玳瑁黄",
        'rgb' => "218, 164, 90",
        'value' => "#daa45a"
    ],
    [
        'name' => "软木黄",
        'rgb' => "222, 158, 68",
        'value' => "#de9e44"
    ],
    [
        'name' => "风帆黄",
        'rgb' => "220, 145, 35",
        'value' => "#dc9123"
    ],
    [
        'name' => "桂皮淡棕",
        'rgb' => "192, 147, 81",
        'value' => "#c09351"
    ],
    [
        'name' => "猴毛灰",
        'rgb' => "151, 132, 108",
        'value' => "#97846c"
    ],
    [
        'name' => "山鸡褐",
        'rgb' => "152, 101, 36",
        'value' => "#986524"
    ],
    [
        'name' => "驼色",
        'rgb' => "102, 70, 42",
        'value' => "#66462a"
    ],
    [
        'name' => "茶褐",
        'rgb' => "93, 61, 33",
        'value' => "#5d3d21"
    ],
    [
        'name' => "古铜褐",
        'rgb' => "92, 55, 25",
        'value' => "#5c3719"
    ],
    [
        'name' => "荷花白",
        'rgb' => "251, 236, 222",
        'value' => "#fbecde"
    ],
    [
        'name' => "玫瑰粉",
        'rgb' => "248, 179, 127",
        'value' => "#f8b37f"
    ],
    [
        'name' => "橘橙",
        'rgb' => "249, 125, 28",
        'value' => "#f97d1c"
    ],
    [
        'name' => "美人焦橙",
        'rgb' => "250, 126, 35",
        'value' => "#fa7e23"
    ],
    [
        'name' => "润红",
        'rgb' => "247, 205, 188",
        'value' => "#f7cdbc"
    ],
    [
        'name' => "淡桃红",
        'rgb' => "246, 206, 193",
        'value' => "#f6cec1"
    ],
    [
        'name' => "海螺橙",
        'rgb' => "240, 148, 93",
        'value' => "#f0945d"
    ],
    [
        'name' => "桃红",
        'rgb' => "240, 173, 160",
        'value' => "#f0ada0"
    ],
    [
        'name' => "颊红",
        'rgb' => "238, 170, 156",
        'value' => "#eeaa9c"
    ],
    [
        'name' => "淡罂粟红",
        'rgb' => "238, 160, 140",
        'value' => "#eea08c"
    ],
    [
        'name' => "晨曦红",
        'rgb' => "234, 137, 88",
        'value' => "#ea8958"
    ],
    [
        'name' => "蟹壳红",
        'rgb' => "242, 118, 53",
        'value' => "#f27635"
    ],
    [
        'name' => "金莲花橙",
        'rgb' => "248, 107, 29",
        'value' => "#f86b1d"
    ],
    [
        'name' => "草莓红",
        'rgb' => "239, 111, 72",
        'value' => "#ef6f48"
    ],
    [
        'name' => "龙睛鱼红",
        'rgb' => "239, 99, 43",
        'value' => "#ef632b"
    ],
    [
        'name' => "蜻蜓红",
        'rgb' => "241, 68, 29",
        'value' => "#f1441d"
    ],
    [
        'name' => "大红",
        'rgb' => "240, 75, 34",
        'value' => "#f04b22"
    ],
    [
        'name' => "柿红",
        'rgb' => "242, 72, 27",
        'value' => "#f2481b"
    ],
    [
        'name' => "榴花红",
        'rgb' => "243, 71, 24",
        'value' => "#f34718"
    ],
    [
        'name' => "银朱",
        'rgb' => "244, 62, 6",
        'value' => "#f43e06"
    ],
    [
        'name' => "朱红",
        'rgb' => "237, 81, 38",
        'value' => "#ed5126"
    ],
    [
        'name' => "鲑鱼红",
        'rgb' => "240, 156, 90",
        'value' => "#f09c5a"
    ],
    [
        'name' => "金黄",
        'rgb' => "242, 123, 31",
        'value' => "#f26b1f"
    ],
    [
        'name' => "鹿皮褐",
        'rgb' => "217, 145, 86",
        'value' => "#d99156"
    ],
    [
        'name' => "醉瓜肉",
        'rgb' => "219, 133, 64",
        'value' => "#db8540"
    ],
    [
        'name' => "麂棕",
        'rgb' => "222, 118, 34",
        'value' => "#de7622"
    ],
    [
        'name' => "淡银灰",
        'rgb' => "193, 178, 163",
        'value' => "#c1b2a3"
    ],
    [
        'name' => "淡赭",
        'rgb' => "190, 126, 74",
        'value' => "#be7e4a"
    ],
    [
        'name' => "槟榔综",
        'rgb' => "193, 101, 26",
        'value' => "#c1651a"
    ],
    [
        'name' => "银灰",
        'rgb' => "145, 128, 114",
        'value' => "#918072"
    ],
    [
        'name' => "海鸥灰",
        'rgb' => "154, 136, 120",
        'value' => "#9a8878"
    ],
    [
        'name' => "淡咖啡",
        'rgb' => "148, 88, 51",
        'value' => "#945833"
    ],
    [
        'name' => "岩石棕",
        'rgb' => "150, 77, 34",
        'value' => "#964d22"
    ],
    [
        'name' => "芒果棕",
        'rgb' => "149, 68, 22",
        'value' => "#954416"
    ],
    [
        'name' => "石板灰",
        'rgb' => "98, 73, 65",
        'value' => "#624941"
    ],
    [
        'name' => "珠母灰",
        'rgb' => "100, 72, 61",
        'value' => "#64483d"
    ],
    [
        'name' => "丁香棕",
        'rgb' => "113, 54, 29",
        'value' => "#71361d"
    ],
    [
        'name' => "咖啡",
        'rgb' => "117, 49, 23",
        'value' => "#753117"
    ],
    [
        'name' => "筍皮棕",
        'rgb' => "115, 46, 18",
        'value' => "#732e12"
    ],
    [
        'name' => "燕颔红",
        'rgb' => "252, 99, 21",
        'value' => "#fc6315"
    ],
    [
        'name' => "玉粉红",
        'rgb' => "232, 180, 154",
        'value' => "#e8b49a"
    ],
    [
        'name' => "金驼",
        'rgb' => "228, 104, 40",
        'value' => "#e46828"
    ],
    [
        'name' => "铁棕",
        'rgb' => "216, 89, 22",
        'value' => "#d85916"
    ],
    [
        'name' => "蛛网灰",
        'rgb' => "183, 160, 145",
        'value' => "#b7a091"
    ],
    [
        'name' => "淡可可棕",
        'rgb' => "183, 81, 29",
        'value' => "#b7511d"
    ],
    [
        'name' => "中红灰",
        'rgb' => "139, 97, 77",
        'value' => "#8b614d"
    ],
    [
        'name' => "淡土黄",
        'rgb' => "140, 75, 49",
        'value' => "#8c4b31"
    ],
    [
        'name' => "淡豆沙",
        'rgb' => "135, 61, 36",
        'value' => "#873d24"
    ],
    [
        'name' => "椰壳棕",
        'rgb' => "136, 58, 30",
        'value' => "#883a1e"
    ],
    [
        'name' => "淡铁灰",
        'rgb' => "91, 66, 58",
        'value' => "#5b423a"
    ],
    [
        'name' => "中灰驼",
        'rgb' => "96, 61, 48",
        'value' => "#603d30"
    ],
    [
        'name' => "淡栗棕",
        'rgb' => "103, 52, 36",
        'value' => "#673424"
    ],
    [
        'name' => "可可棕",
        'rgb' => "101, 43, 28",
        'value' => "#652b1c"
    ],
    [
        'name' => "柞叶棕",
        'rgb' => "105, 42, 27",
        'value' => "#692a1b"
    ],
    [
        'name' => "野蔷薇红",
        'rgb' => "251, 153, 104",
        'value' => "#fb9968"
    ],
    [
        'name' => "菠萝红",
        'rgb' => "252, 121, 48",
        'value' => "#fc7930"
    ],
    [
        'name' => "藕荷",
        'rgb' => "237, 195, 174",
        'value' => "#edc3ae"
    ],
    [
        'name' => "陶瓷红",
        'rgb' => "225, 103, 35",
        'value' => "#e16723"
    ],
    [
        'name' => "晓灰",
        'rgb' => "212, 196, 183",
        'value' => "#d4c4b7"
    ],
    [
        'name' => "余烬红",
        'rgb' => "207, 117, 67",
        'value' => "#cf7543"
    ],
    [
        'name' => "火砖红",
        'rgb' => "205, 98, 39",
        'value' => "#cd6227"
    ],
    [
        'name' => "火泥棕",
        'rgb' => "170, 106, 76",
        'value' => "#aa6a4c"
    ],
    [
        'name' => "绀红",
        'rgb' => "170, 106, 76",
        'value' => "#aa6a4c"
    ],
    [
        'name' => "橡树棕",
        'rgb' => "119, 61, 49",
        'value' => "#773d31"
    ],
    [
        'name' => "海报灰",
        'rgb' => "72, 51, 50",
        'value' => "#483332"
    ],
    [
        'name' => "玫瑰灰",
        'rgb' => "175, 46, 43",
        'value' => "#4b2e2b"
    ],
    [
        'name' => "火山棕",
        'rgb' => "72, 37, 34",
        'value' => "#482522"
    ],
    [
        'name' => "豆沙",
        'rgb' => "72, 30, 28",
        'value' => "#481e1c"
    ],
    [
        'name' => "淡米粉",
        'rgb' => "251, 238, 226",
        'value' => "#fbeee2"
    ],
    [
        'name' => "初桃粉红",
        'rgb' => "246, 220, 206",
        'value' => "#f6dcce"
    ],
    [
        'name' => "介壳淡粉红",
        'rgb' => "247, 207, 186",
        'value' => "#f7cfba"
    ],
    [
        'name' => "淡藏花红",
        'rgb' => "246, 173, 143",
        'value' => "#f6ad8f"
    ],
    [
        'name' => "瓜瓤红",
        'rgb' => "246, 140, 96",
        'value' => "#f68c60"
    ],
    [
        'name' => "芙蓉红",
        'rgb' => "249, 114, 61",
        'value' => "#f9723d"
    ],
    [
        'name' => "莓酱红",
        'rgb' => "250, 93, 25",
        'value' => "#fa5d19"
    ],
    [
        'name' => "法螺红",
        'rgb' => "238, 128, 85",
        'value' => "#ee8055"
    ],
    [
        'name' => "落霞红",
        'rgb' => "207, 72, 19",
        'value' => "#cf4813"
    ],
    [
        'name' => "淡玫瑰灰",
        'rgb' => "184, 148, 133",
        'value' => "#b89485"
    ],
    [
        'name' => "蟹蝥红",
        'rgb' => "177, 75, 40",
        'value' => "#b14b28"
    ],
    [
        'name' => "火岩棕",
        'rgb' => "134, 48, 32",
        'value' => "#863020"
    ],
    [
        'name' => "赭石",
        'rgb' => "134, 38, 23",
        'value' => "#862617"
    ],
    [
        'name' => "暗驼棕",
        'rgb' => "89, 38, 32",
        'value' => "#592620"
    ],
    [
        'name' => "酱棕",
        'rgb' => "90, 31, 27",
        'value' => "#5a1f1b"
    ],
    [
        'name' => "栗棕",
        'rgb' => "92, 30, 25",
        'value' => "#5c1e19"
    ],
    [
        'name' => "洋水仙红",
        'rgb' => "244, 199, 186",
        'value' => "#f4c7ba"
    ],
    [
        'name' => "谷鞘红",
        'rgb' => "241, 118, 102",
        'value' => "#f17666"
    ],
    [
        'name' => "苹果红",
        'rgb' => "241, 86, 66",
        'value' => "#f15642"
    ],
    [
        'name' => "铁水红",
        'rgb' => "245, 57, 28",
        'value' => "#f5391c"
    ],
    [
        'name' => "桂红",
        'rgb' => "242, 90, 71",
        'value' => "#f25a47"
    ],
    [
        'name' => "极光红",
        'rgb' => "243, 59, 31",
        'value' => "#f33b1f"
    ],
    [
        'name' => "粉红",
        'rgb' => "242, 185, 178",
        'value' => "#f2b9b2"
    ],
    [
        'name' => "舌红",
        'rgb' => "241, 151, 144",
        'value' => "#f19790"
    ],
    [
        'name' => "曲红",
        'rgb' => "240, 90, 70",
        'value' => "#f05a46"
    ],
    [
        'name' => "红汞红",
        'rgb' => "242, 62, 35",
        'value' => "#f23e23"
    ],
    [
        'name' => "淡绯",
        'rgb' => "242, 202, 201",
        'value' => "#f2cac9"
    ],
    [
        'name' => "无花果红",
        'rgb' => "239, 175, 173",
        'value' => "#efafad"
    ],
    [
        'name' => "榴子红",
        'rgb' => "241, 144, 140",
        'value' => "#f1908c"
    ],
    [
        'name' => "胭脂红",
        'rgb' => "240, 63, 36",
        'value' => "#f03f24"
    ],
    [
        'name' => "合欢红",
        'rgb' => "240, 161, 168",
        'value' => "#f0a1a8"
    ],
    [
        'name' => "春梅红",
        'rgb' => "241, 147, 156",
        'value' => "#f1939c"
    ],
    [
        'name' => "香叶红",
        'rgb' => "240, 124, 130",
        'value' => "#f07c82"
    ],
    [
        'name' => "珊瑚红",
        'rgb' => "240, 74, 58",
        'value' => "#f04a3a"
    ],
    [
        'name' => "萝卜红",
        'rgb' => "241, 60, 34",
        'value' => "#f13c22"
    ],
    [
        'name' => "淡茜红",
        'rgb' => "231, 124, 142",
        'value' => "#e77c8e"
    ],
    [
        'name' => "艳红",
        'rgb' => "237, 90, 101",
        'value' => "#ed5a65"
    ],
    [
        'name' => "淡菽红",
        'rgb' => "237, 72, 69",
        'value' => "#ed4845"
    ],
    [
        'name' => "鱼鳃红",
        'rgb' => "237, 59, 47",
        'value' => "#ed3b2f"
    ],
    [
        'name' => "樱桃红",
        'rgb' => "237, 51, 33",
        'value' => "#ed3321"
    ],
    [
        'name' => "淡蕊香红",
        'rgb' => "238, 72, 102",
        'value' => "#ee4866"
    ],
    [
        'name' => "石竹红",
        'rgb' => "238, 72, 99",
        'value' => "#ee4863"
    ],
    [
        'name' => "草茉莉红",
        'rgb' => "239, 71, 93",
        'value' => "#ef475d"
    ],
    [
        'name' => "茶花红",
        'rgb' => "238, 63, 77",
        'value' => "#ee3f4d"
    ],
    [
        'name' => "枸枢红",
        'rgb' => "237, 51, 51",
        'value' => "#ed3333"
    ],
    [
        'name' => "秋海棠红",
        'rgb' => "236, 43, 36",
        'value' => "#ec2b24"
    ],
    [
        'name' => "丽春红",
        'rgb' => "235, 38, 26",
        'value' => "#eb261a"
    ],
    [
        'name' => "夕阳红",
        'rgb' => "222, 42, 24",
        'value' => "#de2a18"
    ],
    [
        'name' => "鹤顶红",
        'rgb' => "212, 37, 23",
        'value' => "#d42517"
    ],
    [
        'name' => "鹅血石红",
        'rgb' => "171, 55, 47",
        'value' => "#ab372f"
    ],
    [
        'name' => "覆盆子红",
        'rgb' => "172, 31, 24",
        'value' => "#ac1f18"
    ],
    [
        'name' => "貂紫",
        'rgb' => "93, 49, 49",
        'value' => "#5d3131"
    ],
    [
        'name' => "暗玉紫",
        'rgb' => "92, 34, 35",
        'value' => "#5c2223"
    ],
    [
        'name' => "栗紫",
        'rgb' => "90, 25, 27",
        'value' => "#5a191b"
    ],
    [
        'name' => "葡萄酱紫",
        'rgb' => "90, 18, 22",
        'value' => "#5a1216"
    ],
    [
        'name' => "牡丹粉红",
        'rgb' => "238, 162, 164",
        'value' => "#eea2a4"
    ],
    [
        'name' => "山茶红",
        'rgb' => "237, 85, 106",
        'value' => "#ed556a"
    ],
    [
        'name' => "海棠红",
        'rgb' => "240, 55, 82",
        'value' => "#f03752"
    ],
    [
        'name' => "玉红",
        'rgb' => "192, 72, 81",
        'value' => "#c04851"
    ],
    [
        'name' => "高粱红",
        'rgb' => "192, 44, 56",
        'value' => "#c02c38"
    ],
    [
        'name' => "满江红",
        'rgb' => "167, 83, 90",
        'value' => "#a7535a"
    ],
    [
        'name' => "枣红",
        'rgb' => "124, 24, 35",
        'value' => "#7c1823"
    ],
    [
        'name' => "葡萄紫",
        'rgb' => "76, 31, 36",
        'value' => "#4c1f24"
    ],
    [
        'name' => "酱紫",
        'rgb' => "77, 16, 24",
        'value' => "#4d1018"
    ],
    [
        'name' => "淡曙红",
        'rgb' => "238, 39, 70",
        'value' => "#ee2746"
    ],
    [
        'name' => "唐菖蒲红",
        'rgb' => "222, 28, 49",
        'value' => "#de1c31"
    ],
    [
        'name' => "鹅冠红",
        'rgb' => "209, 26, 45",
        'value' => "#d11a2d"
    ],
    [
        'name' => "莓红",
        'rgb' => "196, 90, 101",
        'value' => "#c45a65"
    ],
    [
        'name' => "枫叶红",
        'rgb' => "194, 31, 48",
        'value' => "#c21f30"
    ],
    [
        'name' => "苋菜红",
        'rgb' => "166, 27, 41",
        'value' => "#a61b29"
    ],
    [
        'name' => "烟红",
        'rgb' => "137, 78, 84",
        'value' => "#894e54"
    ],
    [
        'name' => "暗紫苑红",
        'rgb' => "130, 32, 43",
        'value' => "#82202b"
    ],
    [
        'name' => "殷红",
        'rgb' => "130, 17, 31",
        'value' => "#82111f"
    ],
    [
        'name' => "猪肝紫",
        'rgb' => "84, 30, 36",
        'value' => "#541e24"
    ],
    [
        'name' => "金鱼紫",
        'rgb' => "80, 10, 22",
        'value' => "#500a16"
    ],
    [
        'name' => "草珠红",
        'rgb' => "248, 235, 230",
        'value' => "#f8ebe6"
    ],
    [
        'name' => "淡绛红",
        'rgb' => "236, 118, 150",
        'value' => "#ec7696"
    ],
    [
        'name' => "品红",
        'rgb' => "239, 52, 115",
        'value' => "#ef3473"
    ],
    [
        'name' => "凤仙花红",
        'rgb' => "234, 114, 147",
        'value' => "#ea7293"
    ],
    [
        'name' => "粉团花红",
        'rgb' => "236, 155, 173",
        'value' => "#ec9bad"
    ],
    [
        'name' => "夹竹桃红",
        'rgb' => "235, 80, 126",
        'value' => "#eb507e"
    ],
    [
        'name' => "榲桲舡",
        'rgb' => "237, 47, 106",
        'value' => "#ed2f6a"
    ],
    [
        'name' => "姜红",
        'rgb' => "238, 184, 195",
        'value' => "#eeb8c3"
    ],
    [
        'name' => "莲瓣红",
        'rgb' => "234, 81, 127",
        'value' => "#ea517f"
    ],
    [
        'name' => "水红",
        'rgb' => "241, 196, 205",
        'value' => "#f1c4cd"
    ],
    [
        'name' => "报春红",
        'rgb' => "236, 138, 164",
        'value' => "#ec8aa4"
    ],
    [
        'name' => "月季红",
        'rgb' => "206, 87, 109",
        'value' => "#ce5777"
    ],
    [
        'name' => "豇豆红",
        'rgb' => "237, 157, 178",
        'value' => "#ed9db2"
    ],
    [
        'name' => "霞光红",
        'rgb' => "239, 130, 160",
        'value' => "#ef82a0"
    ],
    [
        'name' => "松叶牡丹红",
        'rgb' => "235, 60, 112",
        'value' => "#eb3c70"
    ],
    [
        'name' => "喜蛋红",
        'rgb' => "236, 44, 100",
        'value' => "#ec2c64"
    ],
    [
        'name' => "鼠鼻红",
        'rgb' => "227, 180, 184",
        'value' => "#e3b4b8"
    ],
    [
        'name' => "尖晶玉红",
        'rgb' => "204, 22, 58",
        'value' => "#cc163a"
    ],
    [
        'name' => "山黎豆红",
        'rgb' => "194, 124, 136",
        'value' => "#c27c88"
    ],
    [
        'name' => "锦葵红",
        'rgb' => "191, 53, 83",
        'value' => "#bf3553"
    ],
    [
        'name' => "鼠背灰",
        'rgb' => "115, 87, 92",
        'value' => "#73575c"
    ],
    [
        'name' => "甘蔗紫",
        'rgb' => "98, 22, 36",
        'value' => "#621624"
    ],
    [
        'name' => "石竹紫",
        'rgb' => "99, 7, 28",
        'value' => "#63071c"
    ],
    [
        'name' => "苍蝇灰",
        'rgb' => "54, 40, 43",
        'value' => "#36282b"
    ],
    [
        'name' => "卵石紫",
        'rgb' => "48, 22, 28",
        'value' => "#30161c"
    ],
    [
        'name' => "李紫",
        'rgb' => "43, 18, 22",
        'value' => "#2b1216"
    ],
    [
        'name' => "茄皮紫",
        'rgb' => "45, 12, 19",
        'value' => "#2d0c13"
    ],
    [
        'name' => "吊钟花红",
        'rgb' => "45, 12, 19",
        'value' => "#2d0c13"
    ],
    [
        'name' => "兔眼红",
        'rgb' => "236, 78, 138",
        'value' => "#ec4e8a"
    ],
    [
        'name' => "紫荆红",
        'rgb' => "238, 44, 121",
        'value' => "#ee2c79"
    ],
    [
        'name' => "菜头紫",
        'rgb' => "149, 28, 72",
        'value' => "#951c48"
    ],
    [
        'name' => "鹞冠紫",
        'rgb' => "98, 29, 52",
        'value' => "#621d34"
    ],
    [
        'name' => "葡萄酒红",
        'rgb' => "98, 16, 46",
        'value' => "#62102e"
    ],
    [
        'name' => "磨石紫",
        'rgb' => "56, 33, 41",
        'value' => "#382129"
    ],
    [
        'name' => "檀紫",
        'rgb' => "56, 25, 36",
        'value' => "#381924"
    ],
    [
        'name' => "火鹅紫",
        'rgb' => "51, 20, 30",
        'value' => "#33141e"
    ],
    [
        'name' => "墨紫",
        'rgb' => "49, 15, 27",
        'value' => "#310f1b"
    ],
    [
        'name' => "晶红",
        'rgb' => "238, 166, 183",
        'value' => "#eea6b7"
    ],
    [
        'name' => "扁豆花红",
        'rgb' => "239, 73, 139",
        'value' => "#ef498b"
    ],
    [
        'name' => "白芨红",
        'rgb' => "222, 120, 151",
        'value' => "#de7897"
    ],
    [
        'name' => "嫩菱红",
        'rgb' => "222, 63, 124",
        'value' => "#de3f7c"
    ],
    [
        'name' => "菠根红",
        'rgb' => "209, 60, 116",
        'value' => "#d13c74"
    ],
    [
        'name' => "酢酱草红",
        'rgb' => "197, 112, 139",
        'value' => "#c5708b"
    ],
    [
        'name' => "洋葱紫",
        'rgb' => "168, 69, 107",
        'value' => "#a8456b"
    ],
    [
        'name' => "海象紫",
        'rgb' => "75, 30, 47",
        'value' => "#4b1e2f"
    ],
    [
        'name' => "绀紫",
        'rgb' => "70, 22, 41",
        'value' => "#461629"
    ],
    [
        'name' => "古铜紫",
        'rgb' => "68, 14, 37",
        'value' => "#440e25"
    ],
    [
        'name' => "石蕊红",
        'rgb' => "240, 201, 207",
        'value' => "#f0c9cf"
    ],
    [
        'name' => "芍药耕红",
        'rgb' => "235, 160, 179",
        'value' => "#eba0b3"
    ],
    [
        'name' => "藏花红",
        'rgb' => "236, 45, 122",
        'value' => "#ec2d7a"
    ],
    [
        'name' => "初荷红",
        'rgb' => "225, 108, 150",
        'value' => "#e16c96"
    ],
    [
        'name' => "马鞭草紫",
        'rgb' => "237, 227, 231",
        'value' => "#ede3e7"
    ],
    [
        'name' => "丁香淡紫",
        'rgb' => "233, 215, 223",
        'value' => "#e9d7df"
    ],
    [
        'name' => "丹紫红",
        'rgb' => "210, 86, 140",
        'value' => "#d2568c"
    ],
    [
        'name' => "玫瑰红",
        'rgb' => "210, 53, 125",
        'value' => "#d2357d"
    ],
    [
        'name' => "淡牵牛紫",
        'rgb' => "209, 194, 211",
        'value' => "#d1c2d3"
    ],
    [
        'name' => "凤信紫",
        'rgb' => "200, 173, 196",
        'value' => "#c8adc4"
    ],
    [
        'name' => "萝兰紫",
        'rgb' => "192, 142, 175",
        'value' => "#c08eaf"
    ],
    [
        'name' => "玫瑰紫",
        'rgb' => "186, 47, 123",
        'value' => "#ba2f7b"
    ],
    [
        'name' => "藤萝紫",
        'rgb' => "128, 118, 163",
        'value' => "#8076a3"
    ],
    [
        'name' => "槿紫",
        'rgb' => "128, 109, 158",
        'value' => "#806d9e"
    ],
    [
        'name' => "蕈紫",
        'rgb' => "129, 92, 148",
        'value' => "#815c94"
    ],
    [
        'name' => "桔梗紫",
        'rgb' => "129, 60, 133",
        'value' => "#813c85"
    ],
    [
        'name' => "魏紫",
        'rgb' => "126, 22, 113",
        'value' => "#7e1671"
    ],
    [
        'name' => "芝兰紫",
        'rgb' => "126, 22, 113",
        'value' => "#7e1671"
    ],
    [
        'name' => "菱锰红",
        'rgb' => "210, 118, 163",
        'value' => "#d276a3"
    ],
    [
        'name' => "龙须红",
        'rgb' => "204, 85, 149",
        'value' => "#cc5595"
    ],
    [
        'name' => "蓟粉红",
        'rgb' => "230, 210, 213",
        'value' => "#e6d2d5"
    ],
    [
        'name' => "电气石红",
        'rgb' => "195, 86, 145",
        'value' => "#c35691"
    ],
    [
        'name' => "樱草紫",
        'rgb' => "192, 111, 152",
        'value' => "#c06f98"
    ],
    [
        'name' => "芦穗灰",
        'rgb' => "189, 174, 173",
        'value' => "#bdaead"
    ],
    [
        'name' => "隐红灰",
        'rgb' => "181, 152, 161",
        'value' => "#b598a1"
    ],
    [
        'name' => "苋菜紫",
        'rgb' => "155, 30, 100",
        'value' => "#9b1e64"
    ],
    [
        'name' => "芦灰",
        'rgb' => "133, 109, 114",
        'value' => "#856d72"
    ],
    [
        'name' => "暮云灰",
        'rgb' => "79, 56, 62",
        'value' => "#4f383e"
    ],
    [
        'name' => "斑鸠灰",
        'rgb' => "72, 41, 54",
        'value' => "#482936"
    ],
    [
        'name' => "淡藤萝紫",
        'rgb' => "242, 231, 229",
        'value' => "#f2e7e5"
    ],
    [
        'name' => "淡青紫",
        'rgb' => "224, 200, 209",
        'value' => "#e0c8d1"
    ],
    [
        'name' => "青蛤壳紫",
        'rgb' => "188, 132, 168",
        'value' => "#bc84a8"
    ],
    [
        'name' => "豆蔻紫",
        'rgb' => "173, 101, 152",
        'value' => "#ad6598"
    ],
    [
        'name' => "扁豆紫",
        'rgb' => "163, 92, 143",
        'value' => "#a35c8f"
    ],
    [
        'name' => "芥花紫",
        'rgb' => "152, 54, 128",
        'value' => "#983680"
    ],
    [
        'name' => "青莲",
        'rgb' => "139, 38, 113",
        'value' => "#8b2671"
    ],
    [
        'name' => "芓紫",
        'rgb' => "137, 66, 118",
        'value' => "#894276"
    ],
    [
        'name' => "葛巾紫",
        'rgb' => "126, 32, 101",
        'value' => "#7e2065"
    ],
    [
        'name' => "牵牛紫",
        'rgb' => "104, 23, 82",
        'value' => "#681752"
    ],
    [
        'name' => "紫灰",
        'rgb' => "93, 63, 81",
        'value' => "#5d3f51"
    ],
    [
        'name' => "龙睛鱼紫",
        'rgb' => "78, 42, 64",
        'value' => "#4e2a40"
    ],
    [
        'name' => "荸荠紫",
        'rgb' => "65, 28, 53",
        'value' => "#411c35"
    ],
    [
        'name' => "古鼎灰",
        'rgb' => "54, 41, 47",
        'value' => "#36292f"
    ],
    [
        'name' => "鸟梅紫",
        'rgb' => "30, 19, 29",
        'value' => "#1e131d"
    ],
    [
        'name' => "深牵牛紫",
        'rgb' => "28, 13, 26",
        'value' => "#1c0d1a"
    ],
    [
        'name' => "银白",
        'rgb' => "241, 240, 237",
        'value' => "#f1f0ed"
    ],
    [
        'name' => "芡食白",
        'rgb' => "226, 225, 228",
        'value' => "#e2e1e4"
    ],
    [
        'name' => "远山紫",
        'rgb' => "204, 204, 214",
        'value' => "#ccccd6"
    ],
    [
        'name' => "淡蓝紫",
        'rgb' => "167, 168, 189",
        'value' => "#a7a8bd"
    ],
    [
        'name' => "山梗紫",
        'rgb' => "97, 100, 159",
        'value' => "#61649f"
    ],
    [
        'name' => "螺甸紫",
        'rgb' => "116, 117, 155",
        'value' => "#74759b"
    ],
    [
        'name' => "玛瑙灰",
        'rgb' => "207, 204, 201",
        'value' => "#cfccc9"
    ],
    [
        'name' => "野菊紫",
        'rgb' => "82, 82, 136",
        'value' => "#525288"
    ],
    [
        'name' => "满天星紫",
        'rgb' => "46, 49, 124",
        'value' => "#2e317c"
    ],
    [
        'name' => "锌灰",
        'rgb' => "122, 115, 116",
        'value' => "#7a7374"
    ],
    [
        'name' => "野葡萄紫",
        'rgb' => "48, 47, 75",
        'value' => "#302f4b"
    ],
    [
        'name' => "剑锋紫",
        'rgb' => "62, 56, 65",
        'value' => "#3e3841"
    ],
    [
        'name' => "龙葵紫",
        'rgb' => "50, 47, 59",
        'value' => "#322f3b"
    ],
    [
        'name' => "暗龙胆紫",
        'rgb' => "34, 32, 46",
        'value' => "#22202e"
    ],
    [
        'name' => "晶石紫",
        'rgb' => "31, 32, 64",
        'value' => "#1f2040"
    ],
    [
        'name' => "暗蓝紫",
        'rgb' => "19, 17, 36",
        'value' => "#131124"
    ],
    [
        'name' => "景泰蓝",
        'rgb' => "39, 117, 182",
        'value' => "#2775b6"
    ],
    [
        'name' => "尼罗蓝",
        'rgb' => "36, 116, 181",
        'value' => "#2474b5"
    ],
    [
        'name' => "远天蓝",
        'rgb' => "208, 223, 230",
        'value' => "#d0dfe6"
    ],
    [
        'name' => "星蓝",
        'rgb' => "147, 181, 207",
        'value' => "#93b5cf"
    ],
    [
        'name' => "羽扇豆蓝",
        'rgb' => "97, 154, 195",
        'value' => "#619ac3"
    ],
    [
        'name' => "花青",
        'rgb' => "35, 118, 183",
        'value' => "#2376b7"
    ],
    [
        'name' => "睛蓝",
        'rgb' => "86, 152, 195",
        'value' => "#5698c3"
    ],
    [
        'name' => "虹蓝",
        'rgb' => "33, 119, 184",
        'value' => "#2177b8"
    ],
    [
        'name' => "湖水蓝",
        'rgb' => "176, 213, 223",
        'value' => "#b0d5df"
    ],
    [
        'name' => "秋波蓝",
        'rgb' => "138, 188, 209",
        'value' => "#8abcd1"
    ],
    [
        'name' => "涧石蓝",
        'rgb' => "102, 169, 201",
        'value' => "#66a9c9"
    ],
    [
        'name' => "潮蓝",
        'rgb' => "41, 131, 187",
        'value' => "#2983bb"
    ],
    [
        'name' => "群青",
        'rgb' => "23, 114, 180",
        'value' => "#1772b4"
    ],
    [
        'name' => "霁青",
        'rgb' => "99, 187, 208",
        'value' => "#63bbd0"
    ],
    [
        'name' => "碧青",
        'rgb' => "92, 179, 204",
        'value' => "#5cb3cc"
    ],
    [
        'name' => "宝石蓝",
        'rgb' => "36, 134, 185",
        'value' => "#2486b9"
    ],
    [
        'name' => "天蓝",
        'rgb' => "22, 119, 179",
        'value' => "#1677b3"
    ],
    [
        'name' => "柏林蓝",
        'rgb' => "18, 107, 174",
        'value' => "#126bae"
    ],
    [
        'name' => "海青",
        'rgb' => "34, 162, 195",
        'value' => "#22a2c3"
    ],
    [
        'name' => "钴蓝",
        'rgb' => "26, 148, 188",
        'value' => "#1a94bc"
    ],
    [
        'name' => "鸢尾蓝",
        'rgb' => "21, 139, 184",
        'value' => "#158bb8"
    ],
    [
        'name' => "牵牛花蓝",
        'rgb' => "17, 119, 176",
        'value' => "#1177b0"
    ],
    [
        'name' => "飞燕草蓝",
        'rgb' => "15, 89, 164",
        'value' => "#0f59a4"
    ],
    [
        'name' => "品蓝",
        'rgb' => "43, 115, 175",
        'value' => "#2b73af"
    ],
    [
        'name' => "银鱼白",
        'rgb' => "205, 209, 211",
        'value' => "#cdd1d3"
    ],
    [
        'name' => "安安蓝",
        'rgb' => "49, 112, 167",
        'value' => "#3170a7"
    ],
    [
        'name' => "鱼尾灰",
        'rgb' => "94, 97, 109",
        'value' => "#5e616d"
    ],
    [
        'name' => "鲸鱼灰",
        'rgb' => "71, 81, 100",
        'value' => "#475164"
    ],
    [
        'name' => "海参灰",
        'rgb' => "255, 254, 250",
        'value' => "#fffefa"
    ],
    [
        'name' => "沙鱼灰",
        'rgb' => "53, 51, 60",
        'value' => "#35333c"
    ],
    [
        'name' => "钢蓝",
        'rgb' => "15, 20, 35",
        'value' => "#0f1423"
    ],
    [
        'name' => "云水蓝",
        'rgb' => "186, 204, 217",
        'value' => "#baccd9"
    ],
    [
        'name' => "晴山蓝",
        'rgb' => "143, 178, 201",
        'value' => "#8fb2c9"
    ],
    [
        'name' => "靛青",
        'rgb' => "22, 97, 171",
        'value' => "#1661ab"
    ],
    [
        'name' => "大理石灰",
        'rgb' => "196, 203, 207",
        'value' => "#c4cbcf"
    ],
    [
        'name' => "海涛蓝",
        'rgb' => "21, 85, 154",
        'value' => "#15559a"
    ],
    [
        'name' => "蝶翅蓝",
        'rgb' => "78, 124, 161",
        'value' => "#4e7ca1"
    ],
    [
        'name' => "海军蓝",
        'rgb' => "52, 108, 156",
        'value' => "#346c9c"
    ],
    [
        'name' => "水牛灰",
        'rgb' => "47, 47, 53",
        'value' => "#2f2f35"
    ],
    [
        'name' => "牛角灰",
        'rgb' => "45, 46, 54",
        'value' => "#2d2e36"
    ],
    [
        'name' => "燕颔蓝",
        'rgb' => "19, 24, 36",
        'value' => "#131824"
    ],
    [
        'name' => "云峰白",
        'rgb' => "216, 227, 231",
        'value' => "#d8e3e7"
    ],
    [
        'name' => "井天蓝",
        'rgb' => "195, 215, 223",
        'value' => "#c3d7df"
    ],
    [
        'name' => "云山蓝",
        'rgb' => "47, 144, 185",
        'value' => "#2f90b9"
    ],
    [
        'name' => "釉蓝",
        'rgb' => "23, 129, 181",
        'value' => "#1781b5"
    ],
    [
        'name' => "鸥蓝",
        'rgb' => "199, 210, 212",
        'value' => "#c7d2d4"
    ],
    [
        'name' => "搪磁蓝",
        'rgb' => "17, 101, 154",
        'value' => "#11659a"
    ],
    [
        'name' => "月影白",
        'rgb' => "192, 196, 195",
        'value' => "#c0c4c3"
    ],
    [
        'name' => "星灰",
        'rgb' => "178, 187, 190",
        'value' => "#b2bbbe"
    ],
    [
        'name' => "淡蓝灰",
        'rgb' => "94, 121, 135",
        'value' => "#5e7987"
    ],
    [
        'name' => "鷃蓝",
        'rgb' => "20, 74, 116",
        'value' => "#144a74"
    ],
    [
        'name' => "嫩灰",
        'rgb' => "116, 120, 122",
        'value' => "#74787a"
    ],
    [
        'name' => "战舰灰",
        'rgb' => "73, 92, 105",
        'value' => "#495c69"
    ],
    [
        'name' => "瓦罐灰",
        'rgb' => "71, 72, 76",
        'value' => "#47484c"
    ],
    [
        'name' => "青灰",
        'rgb' => "43, 51, 62",
        'value' => "#2b333e"
    ],
    [
        'name' => "鸽蓝",
        'rgb' => "28, 41, 56",
        'value' => "#1c2938"
    ],
    [
        'name' => "钢青",
        'rgb' => "20, 35, 52",
        'value' => "#142334"
    ],
    [
        'name' => "暗蓝",
        'rgb' => "16, 31, 48",
        'value' => "#101f30"
    ],
    [
        'name' => "月白",
        'rgb' => "238, 247, 242",
        'value' => "#eef7f2"
    ],
    [
        'name' => "海天蓝",
        'rgb' => "198, 230, 232",
        'value' => "#c6e6e8"
    ],
    [
        'name' => "清水蓝",
        'rgb' => "147, 213, 220",
        'value' => "#93d5dc"
    ],
    [
        'name' => "瀑布蓝",
        'rgb' => "81, 196, 211",
        'value' => "#51c4d3"
    ],
    [
        'name' => "蔚蓝",
        'rgb' => "41, 183, 203",
        'value' => "#29b7cb"
    ],
    [
        'name' => "孔雀蓝",
        'rgb' => "14, 176, 201",
        'value' => "#0eb0c9"
    ],
    [
        'name' => "甸子蓝",
        'rgb' => "16, 174, 194",
        'value' => "#10aec2"
    ],
    [
        'name' => "石绿",
        'rgb' => "87, 195, 194",
        'value' => "#57c3c2"
    ],
    [
        'name' => "竹篁绿",
        'rgb' => "185, 222, 201",
        'value' => "#b9dec9"
    ],
    [
        'name' => "粉绿",
        'rgb' => "131, 203, 172",
        'value' => "#83cbac"
    ],
    [
        'name' => "美蝶绿",
        'rgb' => "18, 170, 156",
        'value' => "#12aa9c"
    ],
    [
        'name' => "毛绿",
        'rgb' => "102, 193, 140",
        'value' => "#66c18c"
    ],
    [
        'name' => "蔻梢绿",
        'rgb' => "93, 190, 138",
        'value' => "#5dbe8a"
    ],
    [
        'name' => "麦苗绿",
        'rgb' => "85, 187, 138",
        'value' => "#55bb8a"
    ],
    [
        'name' => "蛙绿",
        'rgb' => "69, 183, 135",
        'value' => "#45b787"
    ],
    [
        'name' => "铜绿",
        'rgb' => "43, 174, 133",
        'value' => "#2bae85"
    ],
    [
        'name' => "竹绿",
        'rgb' => "27, 167, 132",
        'value' => "#1ba784"
    ],
    [
        'name' => "蓝绿",
        'rgb' => "18, 161, 130",
        'value' => "#12a182"
    ],
    [
        'name' => "穹灰",
        'rgb' => "196, 215, 214",
        'value' => "#c4d7d6"
    ],
    [
        'name' => "翠蓝",
        'rgb' => "30, 158, 179",
        'value' => "#1e9eb3"
    ],
    [
        'name' => "胆矾蓝",
        'rgb' => "15, 149, 176",
        'value' => "#0f95b0"
    ],
    [
        'name' => "樫鸟蓝",
        'rgb' => "20, 145, 168",
        'value' => "#1491a8"
    ],
    [
        'name' => "闪蓝",
        'rgb' => "124, 171, 177",
        'value' => "#7cabb1"
    ],
    [
        'name' => "冰山蓝",
        'rgb' => "164, 172, 167",
        'value' => "#a4aca7"
    ],
    [
        'name' => "虾壳青",
        'rgb' => "134, 157, 157",
        'value' => "#869d9d"
    ],
    [
        'name' => "晚波蓝",
        'rgb' => "100, 142, 147",
        'value' => "#648e93"
    ],
    [
        'name' => "蜻蜓蓝",
        'rgb' => "59, 129, 140",
        'value' => "#3b818c"
    ],
    [
        'name' => "玉鈫蓝",
        'rgb' => "18, 110, 130",
        'value' => "#126e82"
    ],
    [
        'name' => "垩灰",
        'rgb' => "115, 124, 123",
        'value' => "#737c7b"
    ],
    [
        'name' => "夏云灰",
        'rgb' => "97, 113, 114",
        'value' => "#617172"
    ],
    [
        'name' => "苍蓝",
        'rgb' => "19, 72, 87",
        'value' => "#134857"
    ],
    [
        'name' => "黄昏灰",
        'rgb' => "71, 75, 76",
        'value' => "#474b4c"
    ],
    [
        'name' => "灰蓝",
        'rgb' => "33, 55, 61",
        'value' => "#21373d"
    ],
    [
        'name' => "深灰蓝",
        'rgb' => "19, 44, 51",
        'value' => "#132c33"
    ],
    [
        'name' => "玉簪绿",
        'rgb' => "164, 202, 182",
        'value' => "#a4cab6"
    ],
    [
        'name' => "青矾绿",
        'rgb' => "44, 150, 120",
        'value' => "#2c9678"
    ],
    [
        'name' => "草原远绿",
        'rgb' => "154, 190, 175",
        'value' => "#9abeaf"
    ],
    [
        'name' => "梧枝绿",
        'rgb' => "105, 167, 148",
        'value' => "#69a794"
    ],
    [
        'name' => "浪花绿",
        'rgb' => "146, 179, 165",
        'value' => "#92b3a5"
    ],
    [
        'name' => "海王绿",
        'rgb' => "36, 128, 103",
        'value' => "#248067"
    ],
    [
        'name' => "亚丁绿",
        'rgb' => "66, 134, 117",
        'value' => "#428675"
    ],
    [
        'name' => "镍灰",
        'rgb' => "159, 163, 154",
        'value' => "#9fa39a"
    ],
    [
        'name' => "明灰",
        'rgb' => "138, 152, 142",
        'value' => "#8a988e"
    ],
    [
        'name' => "淡绿灰",
        'rgb' => "112, 136, 125",
        'value' => "#70887d"
    ],
    [
        'name' => "飞泉绿",
        'rgb' => "73, 117, 104",
        'value' => "#497568"
    ],
    [
        'name' => "狼烟灰",
        'rgb' => "93, 101, 95",
        'value' => "#5d655f"
    ],
    [
        'name' => "绿灰",
        'rgb' => "49, 74, 67",
        'value' => "#314a43"
    ],
    [
        'name' => "苍绿",
        'rgb' => "34, 62, 54",
        'value' => "#223e36"
    ],
    [
        'name' => "深海绿",
        'rgb' => "26, 59, 50",
        'value' => "#1a3b32"
    ],
    [
        'name' => "长石灰",
        'rgb' => "54, 52, 51",
        'value' => "#363433"
    ],
    [
        'name' => "苷蓝绿",
        'rgb' => "31, 38, 35",
        'value' => "#1f2623"
    ],
    [
        'name' => "莽丛绿",
        'rgb' => "20, 30, 27",
        'value' => "#141e1b"
    ],
    [
        'name' => "淡翠绿",
        'rgb' => "198, 223, 200",
        'value' => "#c6dfc8"
    ],
    [
        'name' => "明绿",
        'rgb' => "158, 204, 171",
        'value' => "#9eccab"
    ],
    [
        'name' => "田园绿",
        'rgb' => "104, 184, 142",
        'value' => "#68b88e"
    ],
    [
        'name' => "翠绿",
        'rgb' => "32, 161, 98",
        'value' => "#20a162"
    ],
    [
        'name' => "淡绿",
        'rgb' => "97, 172, 133",
        'value' => "#61ac85"
    ],
    [
        'name' => "葱绿",
        'rgb' => "64, 160, 112",
        'value' => "#40a070"
    ],
    [
        'name' => "孔雀绿",
        'rgb' => "34, 148, 83",
        'value' => "#229453"
    ],
    [
        'name' => "艾绿",
        'rgb' => "202, 211, 195",
        'value' => "#cad3c3"
    ],
    [
        'name' => "蟾绿",
        'rgb' => "60, 149, 102",
        'value' => "#3c9566"
    ],
    [
        'name' => "宫殿绿",
        'rgb' => "32, 137, 77",
        'value' => "#20894d"
    ],
    [
        'name' => "松霜绿",
        'rgb' => "131, 167, 141",
        'value' => "#83a78d"
    ],
    [
        'name' => "蛋白石绿",
        'rgb' => "87, 149, 114",
        'value' => "#579572"
    ],
    [
        'name' => "薄荷绿",
        'rgb' => "32, 127, 76",
        'value' => "#207f4c"
    ],
    [
        'name' => "瓦松绿",
        'rgb' => "110, 139, 116",
        'value' => "#6e8b74"
    ],
    [
        'name' => "荷叶绿",
        'rgb' => "26, 104, 64",
        'value' => "#1a6840"
    ],
    [
        'name' => "田螺绿",
        'rgb' => "94, 102, 91",
        'value' => "#5e665b"
    ],
    [
        'name' => "白屈菜绿",
        'rgb' => "72, 91, 77",
        'value' => "#485b4d"
    ],
    [
        'name' => "河豚灰",
        'rgb' => "57, 55, 51",
        'value' => "#393733"
    ],
    [
        'name' => "蒽油绿",
        'rgb' => "55, 56, 52",
        'value' => "#373834"
    ],
    [
        'name' => "槲寄生绿",
        'rgb' => "43, 49, 44",
        'value' => "#2b312c"
    ],
    [
        'name' => "云杉绿",
        'rgb' => "21, 35, 27",
        'value' => "#15231b"
    ],
    [
        'name' => "嫩菊绿",
        'rgb' => "240, 245, 229",
        'value' => "#f0f5e5"
    ],
    [
        'name' => "艾背绿",
        'rgb' => "223, 236, 213",
        'value' => "#dfecd5"
    ],
    [
        'name' => "嘉陵水绿",
        'rgb' => "173, 213, 162",
        'value' => "#add5a2"
    ],
    [
        'name' => "玉髓绿",
        'rgb' => "65, 179, 73",
        'value' => "#41b349"
    ],
    [
        'name' => "鲜绿",
        'rgb' => "67, 178, 68",
        'value' => "#43b244"
    ],
    [
        'name' => "宝石绿",
        'rgb' => "65, 174, 60",
        'value' => "#41ae3c"
    ],
    [
        'name' => "海沬绿",
        'rgb' => "226, 231, 191",
        'value' => "#e2e7bf"
    ],
    [
        'name' => "姚黄",
        'rgb' => "208, 222, 170",
        'value' => "#d0deaa"
    ],
    [
        'name' => "橄榄石绿",
        'rgb' => "178, 207, 135",
        'value' => "#b2cf87"
    ],
    [
        'name' => "水绿",
        'rgb' => "140, 194, 105",
        'value' => "#8cc269"
    ],
    [
        'name' => "芦苇绿",
        'rgb' => "183, 208, 122",
        'value' => "#b7d07a"
    ],
    [
        'name' => "槐花黄绿",
        'rgb' => "210, 217, 122",
        'value' => "#d2d97a"
    ],
    [
        'name' => "苹果绿",
        'rgb' => "186, 207, 101",
        'value' => "#bacf65"
    ],
    [
        'name' => "芽绿",
        'rgb' => "150, 194, 78",
        'value' => "#96c24e"
    ],
    [
        'name' => "蝶黄",
        'rgb' => "226, 216, 73",
        'value' => "#e2d849"
    ],
    [
        'name' => "橄榄黄绿",
        'rgb' => "190, 201, 54",
        'value' => "#bec936"
    ],
    [
        'name' => "鹦鹉绿",
        'rgb' => "91, 174, 35",
        'value' => "#5bae23"
    ],
    [
        'name' => "油绿",
        'rgb' => "37, 61, 36",
        'value' => "#253d24"
    ],
    [
        'name' => "象牙白",
        'rgb' => "255, 254, 248",
        'value' => "#fffef8"
    ],
    [
        'name' => "汉白玉",
        'rgb' => "248, 244, 237",
        'value' => "#f8f4ed"
    ],
    [
        'name' => "雪白",
        'rgb' => "255, 254, 249",
        'value' => "#fffef9"
    ],
    [
        'name' => "鱼肚白",
        'rgb' => "247, 244, 237",
        'value' => "#f7f4ed"
    ],
    [
        'name' => "珍珠灰",
        'rgb' => "228, 223, 215",
        'value' => "#e4dfd7"
    ],
    [
        'name' => "浅灰",
        'rgb' => "218, 212, 203",
        'value' => "#dad4cb"
    ],
    [
        'name' => "铅灰",
        'rgb' => "187, 181, 172",
        'value' => "#bbb5ac"
    ],
    [
        'name' => "中灰",
        'rgb' => "187, 181, 172",
        'value' => "#bbb5ac"
    ],
    [
        'name' => "瓦灰",
        'rgb' => "134, 126, 118",
        'value' => "#867e76"
    ],
    [
        'name' => "夜灰",
        'rgb' => "132, 124, 116",
        'value' => "#847c74"
    ],
    [
        'name' => "雁灰",
        'rgb' => "128, 118, 110",
        'value' => "#80766e"
    ],
    [
        'name' => "深灰",
        'rgb' => "129, 119, 110",
        'value' => "#81776e"
    ]
];